AttributeError
# ошибка обращения к свойству или методу класа

IndentationError
# некорректный отступ

IndexError
# список не имеет элемента с таким индексом

KeyError
# словарь не имеет элемента с таким ключом

NameError
# переменная, функция или класс с таким именем, 
# не существует

NotImplementedError
# данный метод в класе не реализован

OverflowError
# слишком большое число

RuntimeError
# нераспознаная ошибка времени выполнения

SyntaxError
# ошибка в записи кода (синтаксическая ошибка)

TabError
# отступ задан табуляциями, а не пробелами

TypeError
# неверный тип параметра функции или метода; 
# свойство или метод не поддерживаюся класом

UnicodeError
# возникла проблема при раскодировании строки, 
# заданной в кодеровке UTF-8

ValueError
# неверное значение аргумента оператора, параметра 
# функции или метода

ZeroDivisionError
# деление на ноль