Applications ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

# Django содержит реестр установленных приложений, который хранит 
# конфигурацию и обеспечивает интроспекцию. Он также ведет список доступных 
# моделей.

# документация на английском:
# https://docs.djangoproject.com/en/2.0/ref/applications/

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

from django.apps import apps

# :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

